# Pandas

In [2]:
pip install pandas

Requirement already satisfied: pandas in c:\users\lenovo\anaconda3\lib\site-packages (1.5.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas) (1.23.5)
Requirement already satisfied: pytz>=2020.1 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\lenovo\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd

## Importing Excel File into Jupyter

In [4]:
df = pd.read_excel("data.xlsx")
df
# pd.read_csv("name.csv")

,Name,Age,Income,Education,Happiness,Distance_to_work_km,Email
0,Alice,25,50000,Bachelor,7,5,alice@example.com
1,Bob,30,60000,Master,8,10,bob@example.com
2,Charlie,22,40000,High School,6,3,charlie@example.com
3,David,35,70000,PhD,9,15,david@example.com
4,Eve,28,55000,Bachelor,7,7,eve@example.com

In [16]:
df.shape

(5, 7)

## Calling Data Frame Columns, Rows and Cells

In [5]:
df.columns

Index(['Name', 'Age', 'Income', 'Education', 'Happiness',
       'Distance_to_work_km', 'Email'],
      dtype='object')

In [6]:
df['Age']

0    25
1    30
2    22
3    35
4    28
Name: Age, dtype: int64

In [17]:
#Multiple columns
df[['Age','Income']]

   Age  Income
2   22   40000
0   25   50000
4   28   55000
1   30   60000
3   35   70000

#### DataFrame.loc

In [7]:
df.loc[0]

Name                               Alice
Age                                   25
Income                             50000
Education                       Bachelor
Happiness                              7
Distance_to_work_km                    5
Email                  alice@example.com
Name: 0, dtype: object

In [8]:
df.loc[0,'Age']

25

In [26]:
df.loc[[0,1],['Age','Income']]

   Age  Income
0   25   50000
1   30   60000

#### DataFrame.iloc

In [9]:
df.iloc[0]

Name                               Alice
Age                                   25
Income                             50000
Education                       Bachelor
Happiness                              7
Distance_to_work_km                    5
Email                  alice@example.com
Name: 0, dtype: object

In [19]:
df.iloc[0,1]

      Name  Age
2  Charlie   22
0    Alice   25

In [24]:
df.iloc[[0,1]]

,Name,Age,Income,Education,Happiness,Distance_to_work_km,Email
2,Charlie,22,40000,High School,6,3,charlie@example.com
0,Alice,25,50000,Bachelor,7,5,alice@example.com

In [25]:
df.iloc[[0,1],[0,1]]

      Name  Age
2  Charlie   22
0    Alice   25

## Sorting Data Frames

In [12]:
df.sort_values('Age',ascending=True)
df
#inplace = True

,Name,Age,Income,Education,Happiness,Distance_to_work_km,Email
2,Charlie,22,40000,High School,6,3,charlie@example.com
0,Alice,25,50000,Bachelor,7,5,alice@example.com
4,Eve,28,55000,Bachelor,7,7,eve@example.com
1,Bob,30,60000,Master,8,10,bob@example.com
3,David,35,70000,PhD,9,15,david@example.com

## Set & Reset Index

In [14]:
df.reset_index(drop=True)
# or
df.reset_index().drop('index',axis=1)
#inplace = True

,Name,Age,Income,Education,Happiness,Distance_to_work_km,Email
0,Charlie,22,40000,High School,6,3,charlie@example.com
1,Alice,25,50000,Bachelor,7,5,alice@example.com
2,Eve,28,55000,Bachelor,7,7,eve@example.com
3,Bob,30,60000,Master,8,10,bob@example.com
4,David,35,70000,PhD,9,15,david@example.com

In [13]:
df.set_index('Age')
#inplace = True

,Name,Income,Education,Happiness,Distance_to_work_km,Email
Age,,,,,,
22,Charlie,40000,High School,6,3,charlie@example.com
25,Alice,50000,Bachelor,7,5,alice@example.com
28,Eve,55000,Bachelor,7,7,eve@example.com
30,Bob,60000,Master,8,10,bob@example.com
35,David,70000,PhD,9,15,david@example.com

## Group by a Column and build a new Data Frame

In [31]:
df.groupby('Education').agg({'Income':'sum','Happiness':'mean'})

             Income  Happiness
Education
Bachelor     105000        7.0
High School   40000        6.0
Master        60000        8.0
PhD           70000        9.0

## Filtering a Data Frame

In [33]:
filt = (df['Education'] == 'Bachelor')
filt

2    False
0     True
4     True
1    False
3    False
Name: Education, dtype: bool

In [34]:
df.loc[filt]

,Name,Age,Income,Education,Happiness,Distance_to_work_km,Email
0,Alice,25,50000,Bachelor,7,5,alice@example.com
4,Eve,28,55000,Bachelor,7,7,eve@example.com